In [17]:
import numpy as np
import pandas as pd

In [24]:
df = pd.read_csv("penguins.csv")
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [25]:
df.isnull().sum()

species               0
island                0
culmen_length_mm      2
culmen_depth_mm       2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [26]:
df.dropna(inplace=True)

In [27]:
island = pd.get_dummies(df['island'], drop_first=True, prefix="i")
df.drop(['island'], axis=1,inplace=True)
df = pd.concat([df,island],axis=1)
df.head()

,species,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex,i_Dream,i_Torgersen
0,Adelie,39.1,18.7,181.0,3750.0,MALE,0,1
1,Adelie,39.5,17.4,186.0,3800.0,FEMALE,0,1
2,Adelie,40.3,18.0,195.0,3250.0,FEMALE,0,1
4,Adelie,36.7,19.3,193.0,3450.0,FEMALE,0,1
5,Adelie,39.3,20.6,190.0,3650.0,MALE,0,1

In [13]:
df.to_csv("penguins_preprocessed.csv", index=False)